app/controllers/orders_controller.rb

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 14

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 13 Dec 2012 15:11:14 UTC +00:00], ["updated_at", Thu, 13 Dec 2012 15:11:14 UTC +00:00]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 14]]