app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%dun%')
SELECT "line_items".* FROM "line_items"
---
  def index
    @products = Product.search(params[:search_query])
    @line_items = LineItem.all