app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "forename", "hashed_password", "location", "salt", "screen_name", "surname", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @title = "Edit Your Details"
    @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1